In [3]:
import pandas as pd

In [4]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
titanic_train = pd.read_csv("https://github.com/datasciencedojo/datasets/blob/master/titanic.csv",
                           sep='\t')   
titanic_train

                                         <!DOCTYPE html>
0      <html lang="en" data-color-mode="auto" data-li...
1                                                 <head>
2                                 <meta charset="utf-8">
3        <link rel="dns-prefetch" href="https://githu...
4        <link rel="dns-prefetch" href="https://avata...
...                                                  ...
14361                                  </clipboard-copy>
14362                                             </div>
14363                                        </template>
14364                                            </body>
14365                                            </html>

[14366 rows x 1 columns]

In [7]:
titanic_train.tail(10)

                                         <!DOCTYPE html>
14356      <path fill-rule="evenodd" d="M5.75 1a.75.7...
14357                                             </svg>
14358        <svg aria-hidden="true" viewBox="0 0 16 ...
14359      <path fill-rule="evenodd" d="M13.78 4.22a....
14360                                             </svg>
14361                                  </clipboard-copy>
14362                                             </div>
14363                                        </template>
14364                                            </body>
14365                                            </html>

In [7]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
titanic_train[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]

In [9]:
titanic_train[['Name','Sex','Ticket','Cabin','Embarked']].describe() #freq=how many times it has occured in the records

                                Name   Sex Ticket Cabin Embarked
count                            156   156    156    31      155
unique                           156     2    145    28        3
top     Nicholls, Mr. Joseph Charles  male   2651  C123        S
freq                               1   100      2     2      110

In [10]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
# If we have 1000 records
# then 25% => 25th record => 250
# then 55% => 50th record => 500
# then 75% => 75th record => 750
# then 100% => 100th record => 1000(max)

titanic_train.describe()  # only works upon int, float (numerical) data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [12]:
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].describe()

                                Name   Sex Ticket Cabin Embarked
count                            156   156    156    31      155
unique                           156     2    145    28        3
top     Nicholls, Mr. Joseph Charles  male   2651  C123        S
freq                               1   100      2     2      110

In [13]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [14]:
titanic_train.dtypes == 'object' # returns true when dtype=object

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [15]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [16]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [17]:

titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [18]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                                Name   Sex Ticket Cabin Embarked
count                            156   156    156    31      155
unique                           156     2    145    28        3
top     Nicholls, Mr. Joseph Charles  male   2651  C123        S
freq                               1   100      2     2      110

In [19]:
titanic_train[['Name','Sex','Age']].head()

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

In [20]:
listt=titanic_train.dtypes[titanic_train.dtypes == "int64"].index

In [21]:
titanic_train[listt].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   156.000000  156.000000  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077    0.615385    0.397436
std      45.177428    0.477275    0.795459    1.056235    0.870146
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%      39.750000    0.000000    2.000000    0.000000    0.000000
50%      78.500000    0.000000    3.000000    0.000000    0.000000
75%     117.250000    1.000000    3.000000    1.000000    0.000000
max     156.000000    1.000000    3.000000    5.000000    5.000000

In [22]:
titanic_train.dtypes == "int64"
a = titanic_train.dtypes[titanic_train.dtypes == "int64"].index
a
titanic_train[a].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   156.000000  156.000000  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077    0.615385    0.397436
std      45.177428    0.477275    0.795459    1.056235    0.870146
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%      39.750000    0.000000    2.000000    0.000000    0.000000
50%      78.500000    0.000000    3.000000    0.000000    0.000000
75%     117.250000    1.000000    3.000000    1.000000    0.000000
max     156.000000    1.000000    3.000000    5.000000    5.000000

In [23]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
titanic_train['Survived'][10:21:2] # Shows 10 to 21 records

10    1
12    0
14    0
16    0
18    0
20    0
Name: Survived, dtype: int64

In [25]:
titanic_train[['Survived']][10:21:2] # displaying in dataframe

    Survived
10         1
12         0
14         0
16         0
18         0
20         0

In [26]:
sorted(titanic_train['Survived']) # sorting the data

[0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1]

In [27]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [28]:
df=pd.DataFrame(sorted(titanic_train['Name'][::]))
print(df)

                                                  0
0    Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
1                          Allen, Mr. William Henry
2                 Andersson, Miss. Ellis Anna Maria
3                   Andersson, Miss. Erna Alexandra
4                       Andersson, Mr. Anders Johan
..                                              ...
151                     Williams, Mr. Charles Duane
152                    Williams, Mr. Charles Eugene
153                               Woolner, Mr. Hugh
154                            Zabour, Miss. Hileni
155                 van Billiard, Mr. Austin Blyler

[156 rows x 1 columns]

In [29]:
sorted(titanic_train["Name"])[::2]# Check the first 15 sorted names

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Mr. Anders Johan',
 'Andreasson, Mr. Paul Edvin',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Attalah, Miss. Malake',
 'Barton, Mr. David John',
 'Baxter, Mr. Quigg Edmond',
 'Bing, Mr. Lee',
 'Boulos, Mrs. Joseph (Sultana)',
 'Burke, Mr. Jeremiah',
 'Caldwell, Master. Alden Gates',
 'Carrau, Mr. Francisco M',
 'Chaffee, Mr. Herbert Fuller',
 'Chronopoulos, Mr. Apostolos',
 'Connors, Mr. Patrick',
 'Crease, Mr. Ernest James',
 'Dean, Mr. Bertram Frank',
 'Doling, Mrs. John T (Ada Julia Bone)',
 'Drazenoic, Mr. Jozef',
 'Emir, Mr. Farred Chehab',
 'Ford, Miss. Robina Maggie "Ruby"',
 'Fortune, Miss. Mabel Helen',
 'Futrelle, Mr. Jacques Heath',
 'Fynney, Mr. Joseph J',
 'Glynn, Miss. Mary Agatha',
 'Goodwin, Master. William Frederick',
 'Greenfield, Mr. William Bertram',
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
 'Harris, Mr. Henry Birkhardt',
 'Hewlett, Mrs. (Mary D Kingcome) ',
 'Holverson, Mr. Alexander Oskar',
 'Icard, Miss. Amelie',
 'Jenkin, Mr. Stephen Curnow',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Kantor, Mr. Sinai',
 'Kraeff, Mr. Theodor',
 'Lennon, Mr. Denis',
 'Mamee, Mr. Hanna',
 'McCarthy, Mr. Timothy J',
 'McGowan, Miss. Anna "Annie"',
 'Meo, Mr. Alfonzo',
 'Mionoff, Mr. Stoytcho',
 'Moore, Mr. Leonard Charles',
 'Moran, Mr. James',
 'Moubarek, Master. Gerios',
 'Nasser, Mr. Nicholas',
 'Navratil, Mr. Michel ("Louis M Hoffman")',
 'Nicholls, Mr. Joseph Charles',
 'Nicola-Yarred, Miss. Jamila',
 'Novel, Mr. Mansouer',
 'Nysten, Miss. Anna Sofia',
 'O\'Dwyer, Miss. Ellen "Nellie"',
 'Osen, Mr. Olaf Elon',
 'Palsson, Master. Gosta Leonard',
 'Panula, Master. Juha Niilo',
 'Pekoniemi, Mr. Edvard',
 'Petranec, Miss. Matilda',
 'Porter, Mr. Walter Chamberlain',
 'Rice, Master. Eugene',
 'Robins, Mrs. Alexander A (Grace Charity Laury)',
 'Rugg, Miss. Emily',
 'Samaan, Mr. Youssef',
 'Saundercock, Mr. William Henry',
 'Shorney, Mr. Charles Joseph',
 'Skoog, Master. Harald',
 'Sloper, Mr. William Thompson',
 'Spencer, Mrs. William Augustus (Marie Eugenie)',
 'Stewart, Mr. Albert A',
 'Turpin, Mr. William John Robert',
 'Uruchurtu, Don. Manuel E',
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
 'Waelens, Mr. Achille',
 'Weisz, Mrs. Leopold (Mathilde Francoise Pede)',
 'Wheadon, Mr. Edward H',
 'White, Mr. Richard Frasar',
 'Williams, Mr. Charles Eugene',
 'Zabour, Miss. Hileni']

In [30]:
titanic_train["Name"].describe()

count                              156
unique                             156
top       Nicholls, Mr. Joseph Charles
freq                                 1
Name: Name, dtype: object

In [31]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [32]:
titanic_train["Ticket"].describe()

count      156
unique     145
top       2651
freq         2
Name: Ticket, dtype: object

In [33]:
titanic_train["sudh"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sdffs

In [34]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [35]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
sudh            object
dtype: object

In [36]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [37]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'sudh'],
      dtype='object')

In [38]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [39]:
# Shows categories of unique total values in the particular column => Categories (3, int64): [1, 2, 3]
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [40]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [41]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [42]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data(by default-object) to string caz string can be iterated to get first letter

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin) # arrange in categories
#new_Cabin
new_Cabin

['n', 'C', 'n', 'C', 'n', ..., 'C', 'n', 'n', 'n', 'n']
Length: 156
Categories (8, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'n']

In [43]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sdffs

In [44]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [45]:
missing = np.where(titanic_train["Age"].isnull() == True) # finds the indexes where the value is null/NAN
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [46]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88], dtype=int64),)

In [47]:
# iloc() function enables us to select a particular cell of the dataset, that is, it helps us select a value that belongs to a particular row or column from a set of values of a data frame or dataset.
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,sdffs
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,sdffs

In [48]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88], dtype=int64),)

In [49]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))][['Name','Age']]

                              Name   Age
27  Fortune, Mr. Charles Alexander  19.0
88      Fortune, Miss. Mabel Helen  23.0

In [50]:
titanic_train.iloc[np.where(titanic_train["Age"]==min(titanic_train["Age"]))][['Name','Cabin','Age']]

                             Name Cabin   Age
78  Caldwell, Master. Alden Gates     n  0.83

In [51]:
titanic_train.iloc[np.where(titanic_train["Age"]==max(titanic_train["Age"]))][['Name','Cabin','Age']]

                         Name Cabin   Age
96  Goldschmidt, Mr. George B     A  71.0

In [52]:
len(missing[0])

30

In [53]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

(array([59, 71], dtype=int64),)

In [54]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,sdffs,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,sdffs,7

In [55]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
se=pd.Series(my_data, index=labels) # provide own indexes' name
se

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [56]:

d = {'a':'Drashty','b':20,'c':30}
d.items
pd.DataFrame(d,index=['a','b','c'])

         a   b   c
a  Drashty  20  30
b  Drashty  20  30
c  Drashty  20  30

In [57]:
print(se[1]) # remembers default index though the index names are alphabetic
print(se['b'])
print(se[0])
print(se['a'])

20
20
10
10

In [58]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [59]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[1])

Holding numerical data
-------------------------
20

In [60]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [61]:

d = {'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [62]:
print ("\nHolding objects from a dictionary\n",'-'*40)
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
 ----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [63]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [64]:
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [65]:
ser1[::-1]

8    4
6    3
4    2
2    1
dtype: int64

In [66]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser2[0])
print("Value for AZ in ser1:", ser2[3])
print("Value for NV in ser2:", ser2[2])

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [90]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser2:\n", ser2[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser2:
CA    1
AZ    5
dtype: int64

In [93]:
ser1 = pd.Series(data=[1,2,3,4],index=['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3 # NAN= caz its there in ser1 but not in ser2 and if both the keys are present in series than its added

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [ ]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3 # NAN= caz its there in ser1 but not in ser2 and if both the keys are present in series than its added

In [85]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [94]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [102]:
from numpy.random import randn as rn
np.random.seed(101) # without seed value the number changes everytime it is made to run
matrix_data = rn(5,4)
matrix_data

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [104]:
pd.DataFrame(matrix_data)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [107]:
df['X'] # extract single column

0   -1.115710
1   -0.411055
2    0.253548
3    0.902398
4   -0.388239
Name: X, dtype: float64

In [108]:
df[['X','Y']] # extract multiple columns

          X         Y
0 -1.115710 -1.385379
1 -0.411055 -0.771329
2  0.253548  0.649148
3  0.902398  0.161781
4 -0.388239  0.783316

In [120]:
df.loc['4'] # extract 4th row

W    0.975720
X   -0.388239
Y    0.783316
Z   -0.708954
Name: 4, dtype: float64

In [121]:
type(df.loc['4'])

pandas.core.series.Series

In [118]:
df.loc[['3','4']]

          W         X         Y         Z
3 -1.080471  0.902398  0.161781  0.833029
4  0.975720 -0.388239  0.783316 -0.708954

In [119]:
type(df.loc[['3','4']]) # considers named indexes

pandas.core.frame.DataFrame

In [137]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['00','11','22','33','44']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings) # row and column names modified/ give own column names
print("\nThe data frame looks like\n",'-'*37, sep='')
df

The data frame looks like
-------------------------------------

           W         X         Y         Z
00  0.386030  2.084019 -0.376519  0.230336
11  0.681209  1.035125 -0.031160  1.939932
22 -1.005187 -0.741790  0.187125 -0.732845
33 -1.382920  1.482495  0.961458 -2.141212
44  0.992573  1.192241 -1.046780  1.292765

In [140]:
df.loc['11':'33','W':'Y'] # range of indexes to extract data

           W         X         Y
11  0.681209  1.035125 -0.031160
22 -1.005187 -0.741790  0.187125
33 -1.382920  1.482495  0.961458

In [135]:
df.iloc[[0,4],[0,3]] # extracting the corner data using default indexes => 0,0 - 0,3 - 4,0 - 4,3

           W         Z
00 -0.993263  0.000366
44 -0.925874  0.610478

In [136]:
df.iloc[[0,-1],[0,-1]]

           W         Z
00 -0.993263  0.000366
44 -0.925874  0.610478

In [124]:
df.iloc[2] # takes the row of default index

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: 22, dtype: float64

In [130]:
df.iloc[[1,2],[1,2]] # row = 1,2 and column = 1,2 => extracting data from intersection

           X         Y
11  0.390528  0.166905
22  0.072960  0.638787

In [131]:
df.loc[['11','22'],['X','Y']] # row = 11,22 and column = X,Y => extracting data from intersection

           X         Y
11  0.390528  0.166905
22  0.072960  0.638787

In [ ]:
df.iloc[[1,2],[1]]

In [147]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [148]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
00    2.084019
11    1.035125
22   -0.741790
33    1.482495
44    1.192241
Name: X, dtype: float64

In [154]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['00','11','22','33','44']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings) # row and column names modified/ give own column names
print("\nThe data frame looks like\n",'-'*37, sep='')
df

The data frame looks like
-------------------------------------

           W         X         Y         Z
00  1.606780 -1.115710 -1.385379 -1.329660
11  0.041460 -0.411055 -0.771329  0.110477
22 -0.804652  0.253548  0.649148  0.358941
33 -1.080471  0.902398  0.161781  0.833029
44  0.975720 -0.388239  0.783316 -0.708954

In [156]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['(Sum of X and Z)'] = df['X']+df['Z']
df['(Sum of Y and Z)'] = df['Y']+df['Z']
df

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------

           W         X         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.115710 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.411055 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.253548  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.902398  0.161781  0.833029          1.735427          0.994811
44  0.975720 -0.388239  0.783316 -0.708954         -1.097192          0.074362

In [157]:
df

           W         X         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.115710 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.411055 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.253548  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.902398  0.161781  0.833029          1.735427          0.994811
44  0.975720 -0.388239  0.783316 -0.708954         -1.097192          0.074362

In [167]:
df.drop('X',1) # axis=0 by default for row and 1 for cols . Doesn't drop permanently

           W         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.161781  0.833029          1.735427          0.994811
44  0.975720  0.783316 -0.708954         -1.097192          0.074362

In [175]:
df

           W         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.161781  0.833029          1.735427          0.994811
44  0.975720  0.783316 -0.708954         -1.097192          0.074362

In [ ]:
df.drop('X',1,inplace=True) # axis=0 by default for row and 1 for cols, inplace=false(default) means would not try to make changes permanently and inplace=True means the changes could be made permanently . Does drop permanently

In [176]:
df

           W         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.161781  0.833029          1.735427          0.994811
44  0.975720  0.783316 -0.708954         -1.097192          0.074362

In [178]:
df.drop('44') # NOT dropped(deleted) from original record permanently

           W         Y         Z  (Sum of X and Z)  (Sum of Y and Z)
00  1.606780 -1.385379 -1.329660         -2.445370         -2.715039
11  0.041460 -0.771329  0.110477         -0.300578         -0.660851
22 -0.804652  0.649148  0.358941          0.612489          1.008088
33 -1.080471  0.161781  0.833029          1.735427          0.994811

In [ ]:
df.ix[]

In [77]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [78]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  1.075055 -0.568877 -1.452124  1.955927  1.387051              1.387051
B -0.815010  0.881175  0.793206 -0.342474  0.538701              0.538701
D -1.548485 -1.424687 -0.829473  1.384292 -0.040395             -0.040395
E -0.585419 -0.693141  0.411276 -0.299925 -0.993066             -0.993066

In [79]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
B -0.815010  0.881175  0.793206 -0.342474  0.538701              0.538701
D -1.548485 -1.424687 -0.829473  1.384292 -0.040395             -0.040395
E -0.585419 -0.693141  0.411276 -0.299925 -0.993066             -0.993066

In [80]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
A  1.075055 -0.568877 -1.452124  1.955927  1.387051
B -0.815010  0.881175  0.793206 -0.342474  0.538701
D -1.548485 -1.424687 -0.829473  1.384292 -0.040395
E -0.585419 -0.693141  0.411276 -0.299925 -0.993066

In [81]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
A  1.075055 -0.568877 -1.452124  1.955927  1.387051
B -0.815010  0.881175  0.793206 -0.342474  0.538701
D -1.548485 -1.424687 -0.829473  1.384292 -0.040395
E -0.585419 -0.693141  0.411276 -0.299925 -0.993066

In [88]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W   -0.483568
X   -1.876997
Y    0.888988
Z    0.227699
Name: D, dtype: float64

In [89]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y         Z
B  0.025186  2.320960 -0.468805 -0.373363
C -0.782741 -0.213686 -0.900201  0.207254

In [ ]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

In [ ]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

In [ ]:
#### Subsetting DataFrame

In [179]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [184]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A  0.586847 -1.621348  0.677535  0.026105
B -1.678284  0.333973 -0.532471  2.117727
C  0.197524  2.302987  0.729024 -0.863091
D  0.305632  0.243178  0.864165 -1.560931
E -0.251897 -0.578120  0.236996  0.200780

In [185]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.532471 -1.678284
C  0.729024  0.197524

In [186]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -1.678284  0.333973
C  0.197524  2.302987
D  0.305632  0.243178

In [ ]:
print(df.loc[['B','C'],])

In [ ]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

In [190]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True  False   True   True
B  False   True  False   True
C   True   True   True  False
D   True   True   True  False
E  False  False   True   True

In [192]:
df.loc[['A','B','C']]>0

       W      X      Y      Z
A   True  False   True   True
B  False   True  False   True
C   True   True   True  False

In [194]:
df[df.loc[['A','B','C']]>0] # enclosed within df to know the false values = NaN

          W         X         Y         Z
A  0.586847       NaN  0.677535  0.026105
B       NaN  0.333973       NaN  2.117727
C  0.197524  2.302987  0.729024       NaN
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

In [189]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True  False   True   True
B  False   True  False   True
C   True   True   True  False

In [187]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A  0.586847       NaN  0.677535  0.026105
B       NaN  0.333973       NaN  2.117727
C  0.197524  2.302987  0.729024       NaN
D  0.305632  0.243178  0.864165       NaN
E       NaN       NaN  0.236996  0.200780

In [196]:
import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [197]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [200]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [202]:
df[df['Height']<65]

   Age  Height  Weight
C   30      62     125
E   25      62     152

In [216]:
df[(df['Age']>30) & (df['Height']>65) & (df['Weight']>125)]

   Age  Height  Weight
B   42      70     148
D   35      68     160

In [ ]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

In [ ]:
df['Height']>65

In [217]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [218]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [219]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [220]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [221]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [225]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index(),end='\n\n\n') # still old index exists
print(df.reset_index(drop=True)) # deletes old index not from original dataset
#print(df.reset_index(drop=True,inplace=True)) # deletes old index from original dataset

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152


   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [223]:
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [ ]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

In [ ]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

In [ ]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

In [ ]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [ ]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

In [ ]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

In [ ]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

In [ ]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

In [ ]:
#cross tabulation like pivot table

In [ ]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))